# tgbot/utils/ui.py

class UI:
    # ===== Основные кнопки юзера =====
    SHOP     = "⬛ Витрина"
    CATALOG  = "⬛ Каталог"
    CART     = "⬜ Корзина"
    PROFILE  = "⚪ Профиль"
    SUPPORT  = "💬 Поддержка"

    # ===== Навигация =====
    BACK     = "↩️ Назад"
    HOME     = "🏠 Главная"
    CLOSE    = "✖️ Закрыть"

    # ===== Действия =====
    BUY      = "🖤 Купить"
    ADD      = "➕ Добавить"
    REMOVE   = "➖ Убрать"
    CLEAR    = "🧹 Очистить"
    PAY      = "💳 Оплатить"
    ORDER    = "✅ Оформить"

    # ===== Админ =====
    ADMIN    = "🛠 Админ-панель"
    PRODUCTS = "📦 Товары"
    CATS     = "🗂 Категории"
    ORDERS   = "📬 Заказы"
    SETTINGS = "⚙️ Настройки"
